package сom.epam.jb27.maksim_atbakanau.lesson1;

public class Task01 {
    public static void main(String[] args) {
//        Создайте java-проект и запустите приложение Hello, world.
        System.out.println("Hello, World!!!");

//        Выведите на консоль ваши ФИО, адрес и телефон.
        System.out.println("Atbakanau Maksim Sergeevich");

//        Выведите на экран следующий текст.
        System.out.println("Пройдет много лет, и полковник Аурелиано Буэндиа, стоя у стены в ожидании расстрела,\n" +
                "вспомнит тот далекий вечер, когда отец взял его с собой посмотреть на лед. Макондо было\n" +
                "тогда небольшим селением с двумя десятками хижин, выстроенных из глины и бамбука на\n" +
                "берегу реки, которая мчала свои прозрачные воды …");

    }
}
