package сom.epam.jb27.maksim_atbakanau.lesson1;

//Напишите программу вычисления суммы четырёх слагаемых.
public class Task03 {
    public static void main(String[] args) {
        double a = 3;
        double b = 4;
        double c = 5;
        double d = 6;

        System.out.println("Сумма слагаемых равна " + (a + b + c + d));
    }

}
